squire-api/app/controllers/products_controller.rb

def index
    #render json: {message: 'I show all products'}
    render json: {products: Product.all}, include: :comments
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = $1  [["product_id", 1]]
SELECT "products".* FROM "products"

  def show
  #render json: {message: 'I show one product'}
  @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def destroy
  #render json: { message: 'I delete a product'}
  @product = Product.find(params[:id])
  @product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]